# -----------------------------
# 0. oh-my-zsh 设置
# -----------------------------
source $ZDOTDIR/oh-my.zsh

# -----------------------------
# 1. 基础设置
# -----------------------------
source $ZDOTDIR/base.zsh   # 基本环境变量、PATH、终端设置等

# -----------------------------
# 2. 函数
# -----------------------------
source $ZDOTDIR/functions.zsh  # 自定义函数、别名

# -----------------------------
# 3. 插件
# -----------------------------
source $ZDOTDIR/plugins.zsh    # zsh 插件加载（如 zsh-syntax-highlighting 等）

# -----------------------------
# 4. 代理/网络
# -----------------------------
source $ZDOTDIR/proxy.zsh      # 网络代理设置

# -----------------------------
# 5. 开发相关
# -----------------------------
source $ZDOTDIR/dev.zsh        # 开发工具/语言相关配置（如 pyenv, nvm 等）

# -----------------------------
# 6. AI
# -----------------------------
[[ -f "$ZDOTDIR/ai.zsh" ]] && source $ZDOTDIR/ai.zsh # AI
